{"config": [{"config": {"name": "lambda_1", "batch_input_shape": [null, 66, 200, 3], "output_shape": null, "arguments": {}, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faH/home/faisal/Development/udacity/nd013/CarND-Behavioral-Cloning/model.py\u00da\b<lambda>\u00a0\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "trainable": true, "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_col": 5, "W_regularizer": null, "name": "convolution2d_1", "border_mode": "valid", "subsample": [2, 2], "W_constraint": null, "nb_filter": 24, "init": "he_normal", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "trainable": true, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_col": 5, "W_regularizer": null, "name": "convolution2d_2", "border_mode": "valid", "subsample": [2, 2], "W_constraint": null, "nb_filter": 36, "init": "he_normal", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "trainable": true, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_col": 5, "W_regularizer": null, "name": "convolution2d_3", "border_mode": "valid", "subsample": [2, 2], "W_constraint": null, "nb_filter": 48, "init": "he_normal", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "trainable": true, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_col": 3, "W_regularizer": null, "name": "convolution2d_4", "border_mode": "valid", "subsample": [1, 1], "W_constraint": null, "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "trainable": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "bias": true, "dim_ordering": "tf", "nb_col": 3, "W_regularizer": null, "name": "convolution2d_5", "border_mode": "valid", "subsample": [1, 1], "W_constraint": null, "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "trainable": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "bias": true, "output_dim": 100, "W_regularizer": null, "name": "dense_1", "input_dim": null, "b_constraint": null, "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "bias": true, "output_dim": 50, "W_regularizer": null, "name": "dense_2", "input_dim": null, "b_constraint": null, "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "bias": true, "output_dim": 10, "W_regularizer": null, "name": "dense_3", "input_dim": null, "b_constraint": null, "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "bias": true, "output_dim": 1, "W_regularizer": null, "name": "dense_4", "input_dim": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}